88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
  *percent = 2808.3808 * pow(*volt, 4) - 43560.9157 * pow(*volt, 3) + 252848.5888 * pow(*volt, 2) - 650767.4615 * *volt + 626532.5703;
  
  if(*percent<0) *percent =0; // to ensure that the above formula does not produce negative values, as it does slightly above 3.5V

  if (*volt > 4.19) *percent = 100;
  else if (*volt <= 3.50) *percent = 0;

  sprintf(outstring,"GPIO: %d  readval: %d Voltage: %3.2f Percent: %3.1f\n",
      VOLTAGE_PIN,readval, *volt,*percent);
  logOut(2,outstring);
  return(true);
}


/**************************************************!
   @brief    handleButtonInterrupt()
   @details  interrupt handling for button pressed on rotary encoder
   @return   void
***************************************************/
volatile bool buttonEvent = false;
volatile unsigned long lastInterruptTime = 0;

void IRAM_ATTR handleButtonInterrupt() {
  unsigned long now = millis();

  // simples Entprellen
  if (now - lastInterruptTime > 400) {
    buttonEvent = true;
    lastInterruptTime = now;
    doParallelBuzzer(1,50,0); // buzzer feedback
  }
}

// possibly better, not yet used 30.1.26
void ARDUINO_ISR_ATTR button1Handler()
{
    if(!button1.pressed)  // avoid repeated pressed to be counted, entprellen
      button1.numberKeyPresses += 1;
    button1.pressed = true;
    //sprintf(outstring, "Button 1 pressed %d\n", button1.numberKeyPresses);
    //logOut(2,outstring);
}

/**************************************************!
   @brief    displayGPSInfo()
   @details  display GPS info, if available
   @return   void
***************************************************/
void displayGPSInfo()
{
  strcpy(outstring,"");

  if (gps.location.isValid())
  {
    double distanceToStart = TinyGPSPlus::distanceBetween(
      gps.location.lat(),
      gps.location.lng(), 
      anchorLat,
      anchorLon);
    double courseToStart = TinyGPSPlus::courseTo(
      gps.location.lat(),
      gps.location.lng(),
      anchorLat,
      anchorLon);
    
    wData.actLat = gps.location.lat();
    wData.actLon = gps.location.lng();
    sprintf(outstring," GPS Sats: #%ld HDOP: %4.2f Dist2Start: %4.2f m Course2Start: %4.2f° Stored Lat/Lon: %6.4f %6.4f",
        gps.satellites.value(),gps.hdop.hdop(), distanceToStart, courseToStart, wData.actLat , wData.actLon);
    logOut(2, outstring);
  }
  else
  {
    //Serial.print(F("INVALID"));
  }

  // Serial.print(F("  Date/Time: "));
  if (gps.date.isValid())
  {
    //Serial.print(F("  Date/Time: "));
    //Serial.print(gps.date.day());
    //Serial.print(F("."));
    //Serial.print(gps.date.month());
    //Serial.print(F("."));
    //Serial.print(gps.date.year());
    sprintf(outstring,"%s Date: %02d.%02d.%04d",
        outstring, gps.date.day(),gps.date.month(),gps.date.year());
  }
  else
  {
    //Serial.print(F("INVALID"));
  }

  //Serial.print(F(" "));
  if (gps.time.isValid())
  {
    //Serial.print(F(" "));
    //if (gps.time.hour() < 10) Serial.print(F("0"));
    //Serial.print(gps.time.hour());
    //Serial.print(F(":"));
    //if (gps.time.minute() < 10) Serial.print(F("0"));
    //Serial.print(gps.time.minute());
    //Serial.print(F(":"));
    //if (gps.time.second() < 10) Serial.print(F("0"));
    //Serial.print(gps.time.second());
    //Serial.print(F("."));
    //if (gps.time.centisecond() < 10) Serial.print(F("0"));
    //Serial.print(gps.time.centisecond());
    //Serial.print(F(" "));
    sprintf(outstring,"%s Time: %02d:%02d:%02d.%02d",
        outstring, gps.time.hour(),gps.time.minute(),gps.time.second(),gps.time.centisecond());
  }
  else
  {
    //Serial.print(F("INVALID"));
  }

  logOut(2, outstring);
  //Serial.println();
}

#include <math.h>

#define EARTH_RADIUS 6371000.0  // Meter

/**************************************************!
   @brief    gps_offset()
   @details  Calculate new GPS position given start coords, distance and bearing
   @param    double lat1_deg      : start latitude in degrees
   @param    double lon1_deg      : start longitude in degrees
   @param    double distance_m    : distance to move in meters
   @param    double bearing_deg   : bearing in degrees
   @param    double *lat2_deg     : pointer to store resulting latitude in degrees
   @param    double *lon2_deg     : pointer to store resulting longitude in degrees
   @return   void
***************************************************/
void gps_offset(
    double lat1_deg,
    double lon1_deg,
    double distance_m,
    double bearing_deg,
    double *lat2_deg,
    double *lon2_deg
) {
    // Grad → Radiant
    double lat1 = lat1_deg * M_PI / 180.0;
    double lon1 = lon1_deg * M_PI / 180.0;
    double bearing = bearing_deg * M_PI / 180.0;

    // Winkelstrecke
    double delta = distance_m / EARTH_RADIUS;

    // Neue Breite
    double lat2 = asin(
        sin(lat1) * cos(delta) +
        cos(lat1) * sin(delta) * cos(bearing)
    );

    // Neue Länge
    double lon2 = lon1 + atan2(
        sin(bearing) * sin(delta) * cos(lat1),
        cos(delta) - sin(lat1) * sin(lat2)
    );

    // Radiant → Grad
    *lat2_deg = lat2 * 180.0 / M_PI;
    *lon2_deg = lon2 * 180.0 / M_PI;
}

/**************************************************!
   @brief    getGPSStartPosition()
   @details  get the initial start position from GPS, averaging several readings
   @param    double *startLat : pointer to store start latitude (Breitengrad)  
   @param    double *startLon : pointer to store start longitude (Längengrad)
   @return   void
***************************************************/
void getGPSStartPosition(double *startLat, double *startLon) // get start position from GPS
{
  Serial.println(F("Getting GPS start position..."));
  uint32_t start = millis();
  int cnt = 0, avg = 5;

  *startLat = 0;
  *startLon = 0;

  // wait up to 30 seconds for GPS fix
  while (millis() - start < 30000)
  {
    while (ss.available() > 0)
    {
      char c = ss.read();
      Serial.write(c); // uncomment to see raw GPS data
      gps.encode(c);
      if (gps.location.isUpdated())
      {
        cnt++;
        /*
        Serial.print(F("Fix #"));
        Serial.print(cnt+1);
        Serial.print(F(" Sats: "));
        Serial.print(gps.satellites.value());
        Serial.print(F(" HDOP: "));
        Serial.print(gps.hdop.hdop(), 2);   
        */
        sprintf(outstring,"Fix #%d Sats:%ld  HDOP: %4.2f", 
            cnt+1,gps.satellites.value(),gps.hdop.hdop());
        logOut(2, outstring);  
        
        *startLat += gps.location.lat();
        *startLon += gps.location.lng();
        /*
        Serial.print(cnt, 2);
        Serial.print(F("Start position acquired :"));
        Serial.print(*startLat/cnt, 6);
        Serial.print(F(", "));
        Serial.println(*startLon/cnt, 6);
        */
        sprintf(outstring,"Start position acquired in %d Lat:%6.6f, Lon:%6.6f",
          cnt, *startLat/cnt, *startLon/cnt);
        logOut(2, outstring);    
      }
      if(cnt>=avg){
        *startLat /= cnt;
        *startLon /= cnt;
        /*
        Serial.print(F("Averaged start position: "));
        Serial.print(*startLat, 6);
        Serial.print(F(", "));
        Serial.println(*startLon, 6);
        */
        sprintf(outstring,"Averaged start position Lat:%6.6f, Lon:%6.6f",
          *startLat, *startLon);
        logOut(2, outstring);  
        return;
      }
    }
  }
  Serial.println(F("Failed to acquire GPS start position within 30 seconds."));

